app/controllers/students_controller.rb

  def create
    @student = Student.create(post_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Angelo"], ["last_name", "X"], ["created_at", "2020-12-10 05:45:23.503042"], ["updated_at", "2020-12-10 05:45:23.503042"]]

  def update
		@student = Student.find(params[:id])
	  @student.update(post_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Raul"], ["updated_at", "2020-12-10 05:44:31.900259"], ["id", 1]]